
<?php 


$arrr = "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอิเล็คทรอนิคส์และโทรคมนาคม,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมโยธา,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมสำรวจ,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมการผลิตความแม่นยำสูง,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมซ่อมบำรุงอากาศยาน,วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอัตโนมัติและหุ่นยนต์,ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมเครื่องกล,ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ,ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีอุตสาหการ,ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิชาเทคโนโลยีวิศวกรรมคอมพิวเตอร์,คหกรรมศาสตรบัณฑิต สาขาวิชาอาหารและโภชนาการ,คหกรรมศาสตรบัณฑิต สาขาวิชาธุรกิจอาหาร,คหกรรมศาสตรบัณฑิต สาขาวิชาเทคโนโลยีเสื้อผ้าและแพตเทิร์น,เทคโนโลยีบัณฑิต สาขาวิชาการออกแบบแฟชั่น,วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์และเทคโนโลยีการอาหาร,วิทยาศาสตรบัณฑิต สาขาวิชาการพัฒนาผลิตภัณฑ์อาหาร,ศึกษาศาสตรบัณฑิต สาขาวิชาคหกรรมศาสตร์ศึกษา,ศิลปศาสตรบัณฑิต สาขาวิชาภาษาอังกฤษเพื่อการสื่อสารสากล,ศิลปศาสตรบัณฑิต สาขาวิชาภาษาจีนเพื่อการสื่อสาร,ศิลปศาสตรบัณฑิต สาขาวิชาภาษาญี่ปุ่น,ศิลปศาสตรบัณฑิต สาขาวิชาการท่องเที่ยว,ศิลปศาสตรบัณฑิต สาขาวิชาการโรงแรม,ศิลปศาสตรบัณฑิต สาขาวิชาการพัฒนาผลิตภัณฑ์ภูมิปัญญาไทย,วิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมสิ่งทอ,เทคโนโลยีบัณฑิต สาขาวิชาออกแบบสิ่งทอและแฟชั่น,วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสิ่งทอ,บัญชีบัณฑิต,บริหารธุรกิจบัณฑิต สาขาวิชาการเงิน,บริหารธุรกิจบัณฑิต สาขาวิชาการประเมินราคาทรัพย์สิน,บริหารธุรกิจบัณฑิต สาขาวิชาการตลาด,บริหารธุรกิจบัณฑิต สาขาวิชาการจัดการ,บริหารธุรกิจบัณฑิต สาขาวิชาการสื่อสารธุรกิจระหว่างประเทศ,บริหารธุรกิจบัณฑิต สาขาวิชาระบบสารสนเทศ,เทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศและธุรกิจดิจิทัจ,วิทยาศาสตรบัณฑิตเคมี,วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีและการจัดการความปลอดภัยของอาหาร,วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาการคอมพิวเตอร์,วิทยาศาสตรบัณฑิต สาขาวิชาเทคโนโลยีสารสนเทศ,วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์เพื่อสุขภาพและความงาม,เทคโนโลยีบัณฑิต สาขาวิชาออกแบบผลิตภัณฑ์อุตสาหกรรม,เทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีการถ่ายภาพและภาพยนตร์,เทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีการพิมพ์,เทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีเครื่องเรือนและการออกแบบ,เทคโนโลยีบัณฑิต สาขาวิชาเทคโนโลยีการโทรทัศน์และวิทยุกระจายเสียง			
";
$arr = "วิศวกรรมไฟฟ้า,วิศวกรรมอิเล็คทรอนิคส์และโทรคมนาคม,วิศวกรรมโยธา,วิศวกรรมสำรวจ,วิศวกรรมเครื่องกล,วิศวกรรมอุตสาหการ,วิศวกรรมเคมี,วิศวกรรมการผลิตความแม่นยำสูง,วิศวกรรมซ่อมบำรุงอากาศยาน,วิศวกรรมอัตโนมัติและหุ่นยนต์,วิศวกรรมเครื่องกล,วิศวกรรมอุตสาหการ,เทคโนโลยีอุตสาหการ,เทคโนโลยีวิศวกรรมคอมพิวเตอร์,อาหารและโภชนาการ,ธุรกิจอาหาร,เทคโนโลยีเสื้อผ้าและแพตเทิร์น,การออกแบบแฟชั่น,วิทยาศาสตร์และเทคโนโลยีการอาหาร,การพัฒนาผลิตภัณฑ์อาหาร,คหกรรมศาสตร์ศึกษา,ภาษาอังกฤษเพื่อการสื่อสารสากล,ภาษาจีนเพื่อการสื่อสาร,ภาษาญี่ปุ่น,การท่องเที่ยว,การโรงแรม,การพัฒนาผลิตภัณฑ์ภูมิปัญญาไทย,นวัตกรรมสิ่งทอ,ออกแบบสิ่งทอและแฟชั่น,เทคโนโลยีสิ่งทอ,การบัญชี,การเงิน,การประเมินราคาทรัพย์สิน,การตลาด,การจัดการ,การสื่อสารธุรกิจระหว่างประเทศ,ระบบสารสนเทศ,เทคโนโลยีสารสนเทศและธุรกิจดิจิทัจ,เคมี,เทคโนโลยีและการจัดการความปลอดภัยของอาหาร,วิทยาการคอมพิวเตอร์,เทคโนโลยีสารสนเทศ,วิทยาศาสตร์เพื่อสุขภาพและความงาม,ออกแบบผลิตภัณฑ์อุตสาหกรรม,เทคโนโลยีการถ่ายภาพและภาพยนตร์,เทคโนโลยีการพิมพ์,เทคโนโลยีเครื่องเรือนและการออกแบบ,เทคโนโลยีการโทรทัศน์และวิทยุกระจายเสียง
";
$fruits_ar = explode(',', $arrr);
echo "<pre>";
//print_r($fruits_ar);
echo "</pre>";

include '../conn.php';
 $i = 3;
foreach ($fruits_ar as $value) {

$sql = "UPDATE `mis`.`saka` SET `saka_laksut` = '$value' WHERE `saka`.`saka_id` = $i";

if ($conn->query($sql) === TRUE) {
    
    echo $value." ---- Ok <br>";
} else {
    echo "Error: " . $sql . "<br>" . $conn->error;
}

$i++;
}


$conn->close();



?>