

<h5 ><p style="text-align: center;">แบบข้อตกลงการประเมินผลสัมฤทธิ์ของงานของข้าราชการพลเรือนในสถาบันอุดมศึกษา/พนักงานมหาวิทยาลัย (องค์ประกอบที่ ๑)<br>
ตำแหน่งประเภทผู้บริหาร มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ</p>
<p>รอบการประเมิน</p>

รอบที่ ๑	&nbsp;&nbsp;&nbsp;&nbsp;๑  ตุลาคม  .. ๒๕๖๓ ..  ถึง&nbsp;&nbsp;  ๓๑  มีนาคม  .. ๒๕๖๓ ..
<br><br>

<!-- รอบที่ ๒  &nbsp;&nbsp;&nbsp;&nbsp;๑  เมษายน  .. ๒๕๖๓ ..  ถึง &nbsp;&nbsp; ๓๐  กันยายน  .. ๒๕๖๓ ..	
 -->
 
ชื่อผู้รับการประเมิน 		
นาย ....ทดสอบ....... ตำแหน่ง/ระดับ...ทดสอบตำแหน่ง &nbsp;&nbsp;ชื่อผู้บังคับบัญชา&nbsp;&nbsp;นาย....ทดสอบชื่อผูเบังคับ....... ตำแหน่ง/ระดับ...ทดสอบตำแหน่ง</h5>


<br>
